RUS_START = """
Добрый день. Я - чат-бот. Спрашивайте меня, если у вас есть вопросы.       
Я помогу вам разобраться в миграционном законодательстве и правилах нахождения в Пензенской области.
Выберите один из интересующих вас разделов ниже
"""

RUS_R1 = """
Миграционный и регистрационный учет
Каждый иностранец, въехавший в Российскую Федерацию, в обязательном порядке должен встать на миграционный учет по месту пребывания для легального нахождения на территории Российской Федерации, т.е. уведомить миграционную службу о своем прибытии в место пребывания. Уведомление о прибытии в место пребывания иностранного гражданина подается в территориальный орган МВД России не позднее 7 рабочих дней со дня его прибытия в место пребывания (за исключением случаев, предусмотренных Федеральным законом от 18 июля 2006 г. № 109-ФЗ «О миграционном учете иностранных граждан и лиц без гражданства в Российской Федерации» и международными договорами). Регистрации по месту жительства подлежат временно (имеющие разрешение на временное проживание) или постоянно (имеющие вид на жительство) проживающие в Российской Федерации иностранные граждане и лица без гражданства, обладающие правом пользования жилым помещением, находящимся на территории Российской Федерации. Необходимые документы для регистрации по месту жительства подаются иностранным гражданином или лицом без гражданства в территориальный орган МВД России в месте нахождения жилого помещения непосредственно. 
Необходимые документы
Миграционный учет по месту пребывания: 
Принимающая сторона предоставляет в территориальный орган МВД России лично, в электронной форме, через МФЦ или по почте: 
1. Уведомление о прибытии иностранного гражданина или лица без гражданства в место пребывания. 
2. Документ, удостоверяющий личность иностранного гражданина или лица без гражданства. 
3. Миграционную карту или визу (при ее наличии). 
4. Документ, подтверждающий право пользования жилым или иным помещением, предоставляемым для фактического проживания иностранному гражданину, в случае отсутствия сведений, содержащихся в распоряжении органов, предоставляющих государственные услуги, органов, предоставляющих муниципальные услуги, иных государственных органов, органов местного самоуправления либо подведомственных государственным органам или органам местного самоуправления организаций, участвующих в предоставлении государственных или муниципальных услуг. 
5. Трудовой или гражданско-правовой договор иностранного гражданина с организацией или иной документ, подтверждающий осуществление иностранным гражданином трудовой или иной не запрещенной законодательством Российской Федерации деятельности, а также письмо руководителя либо иного уполномоченного должностного лица организации, подпись которого скрепляется печатью организации (при ее наличии).
 
Регистрационный учет по месту жительства: 
Постоянно или временно проживающий в Российской Федерации иностранный гражданин, обладающий правом пользования жилым помещением, находящимся на территории Российской Федерации, для осуществления регистрации по месту жительства подает в территориальный орган МВД России в месте нахождения жилого помещения непосредственно – лично, в электронной форме, через МФЦ: 
1. Заявление о регистрации по месту жительства установленной формы. 
2. Документ, удостоверяющий личность. 
3. Вид на жительство или разрешение на временное проживание. 
4. Документы, подтверждающие право пользования жилым помещением в соответствии с законодательством Российской Федерации (договор, свидетельство о праве собственности либо иной документ), и их копии. 

Сроки
Должностное лицо проставляет соответствующую отметку о постановке на миграционный учет/ регистрации по месту жительства в день обращения. 
"""
RUS_R2_1 = """
Трудовой патент
Патент на работу для иностранных граждан – это разрешение на осуществление трудовой деятельности в Российской Федерации для иностранных граждан, прибывших на территорию Российской Федерации в порядке, не требующем получение визы. Другими словами, патент на работу – это документ, необходимый каждому иностранному гражданину, приехавшему в Россию в безвизовом порядке, который планирует легально осуществлять трудовую деятельность на территории Российской Федерации. Патент на работу потребуется гражданам таких стран, как, например, Молдова, Азербайджан, Узбекистан, Таджикистан. Без оформления патента имеют право работать на территории Российской Федерации иностранные граждане: 
1. Имеющие разрешение на временное проживание или вид на жительство в Российской Федерации, а также имеющие статус участника Государственной программы переселения в Российской Федерацию соотечественников, проживающих за рубежом. 
2. Имеющие статус беженца в Российской Федерации либо являющиеся лицами, которым предоставлено временное убежище на территории Российской Федерации. 
3. Являющиеся студентами очной формы обучения в профессиональных образовательных организациях и образовательных организациях высшего образования Российской Федерации в течение каникул или работающих в свободное от учебы время в этих образовательных организациях, в хозяйственных обществах или в хозяйственных партнерствах, созданных бюджетными или автономными образовательными организациями высшего образования, в которых они обучаются. 
4. Представители стран-участников Евразийского экономического союза (ЕАЭС): Белоруссия, Армения, Казахстан и Киргизия.
Необходимые документы
1. Заявление о выдаче, оформлении, переоформлении патента в одном экземпляре. 
2. Документ, удостоверяющий личность данного иностранного гражданина и признаваемый Российской Федерацией в этом качестве. 
3. Действующий на территории Российской Федерации на срок осуществления трудовой деятельности иностранным гражданином договор (полис) добровольного медицинского страхования, заключенный со страховой организацией, созданной в соответствии с законодательством Российской Федерации, либо договор о предоставлении платных медицинских услуг, заключенный с медицинской организацией, находящейся в субъекте Российской Федерации, на территории которого данный иностранный гражданин намеревается осуществлять трудовую деятельность. 
"""
RUS_R2_2 = """
4. Документы, подтверждающие отсутствие у иностранного гражданина заболевания наркоманией и выданные по результатам медицинского осмотра, включающего в себя химико-токсикологические исследования наличия в организме человека наркотических средств, психотропных веществ и их метаболитов, и инфекционных заболеваний, которые представляют опасность для окружающих, предусмотренных перечнем инфекционных заболеваний, представляющих опасность для окружающих и являющихся основанием для отказа в выдаче либо аннулирования разрешения на времоживание иностранных граждан и лиц без гражданства, или вида на жительство, или патента, или разрешения на работу в Российской Федерации, утвержденным приказом Министерства здравоохранения Российской Федерации от 19 ноября 2021 г. № 1079н, а также сертификат об отсутствии у иностранного гражданина заболевания, вызываемого вирусом иммунодефицита человека (ВИЧ-инфекции). 
5. Ходатайство работодателя, заказчика работ (услуг) о переоформлении иностранному гражданину патента. 
6. Для иностранных граждан, осуществляющих трудовую деятельность у юридического лица или индивидуального предпринимателя либо частного нотариуса, адвоката, учредившего адвокатский кабинет, или иного лица, чья профессиональная деятельность в соответствии с федеральными законами подлежит государственной регистрации и (или) лицензированию: трудовой договор или гражданско-правовой договор на выполнение работ (оказание услуг), заключенные между иностранным гражданином и работодателем, заказчиком работ (услуг). 
7. Один из следующих документов, подтверждающих владение русским языком, знание истории России и основ законодательства Российской Федерации: - сертификат о владении русским языком, знании истории России и основ законодательства Российской Федерации. 
- документ государственного образца об образовании (на уровне не ниже основного общего образования), выданный образовательным учреждением на территории государства, входившего в состав СССР, до 1 сентября 1991 года. 
- документ об образовании и (или) о квалификации, выданный лицам, успешно прошедшим государственную итоговую аттестацию на территории Российской Федерации с 1 сентября 1991 года. 
Сроки
1. Срок оформления и выдачи иностранному гражданину патента не должен превышать 10 рабочих дней со дня принятия от иностранного гражданина заявления о выдаче патента, а при наличии сведений о постановке иностранного гражданина на учет в налоговом органе не позднее пяти рабочих дней со дня принятия от иностранного гражданина заявления. 
2. Срок оформления и выдачи иностранному гражданину дубликата патента не должен превышать 3 рабочих дней со дня обращения заявителя в подразделение по вопросам миграции с соответствующим запросом. 
3. Срок аннулирования патента составляет 3 рабочих дня со дня приема заявления об аннулировании патента. Документы, являющиеся результатом предоставления услуги, выдаются иностранному гражданину в день обращения за их получением.
"""
RUS_R3 = """
Разрешение на работу в РФ
Разрешение на работу – это документ, подтверждающий право иностранного гражданина или лица без гражданства, прибывающего в Российской Федерации в визовом порядке, на осуществление трудовой деятельности в Российской Федерации у юридического лица или индивидуального предпринимателя. При отсутствии данного документа трудовая деятельность иностранного гражданина будет считаться незаконной. Компании, в которых трудятся работники без разрешения на работу в России, могут быть оштрафованы на сумму до 1 000 000 рублей за каждого нелегального сотрудника, а в случае выявления повторных нарушений оформления работников предприятие могут лишить права продолжать свою предпринимательскую деятельность. 
Необходимые документы
1. Заявление об оформлении разрешения на работу на каждого привлекаемого иностранного гражданина. 
2. Копию документа, удостоверяющего личность иностранного гражданина и признаваемого Российской Федерацией в этом качестве. 
3. Медицинские документы. 
 
Для высококвалифицированного специалиста: 
1. Ходатайство о привлечении высококвалифицированного специалиста. 
2. Копию документа, удостоверяющего личность иностранного гражданина и признаваемого Российской Федерацией в этом качестве. 
3. Трудовой договор или гражданско-правовой договор на выполнение работ (оказание услуг) с привлекаемым высококвалифицированным специалистом, вступление в силу которого обусловлено получением данным высококвалифицированным специалистом разрешения на работу. 
4. Письменное обязательство оплатить (возместить) расходы Российской Федерации, связанные с возможным административным выдворением за пределы Российской Федерации или депортацией привлекаемого им высококвалифицированного специалиста. 
Сроки
1. Срок выдачи иностранному гражданину, прибывшему в Российскую Федерацию в порядке, требующем получения визы, разрешения на работу составляет 15 рабочих дней со дня приема документов, необходимых для предоставления услуги. 
2. Срок выдачи разрешения на работу высококвалифицированному специалисту и членам его семьи, а также продления срока действия разрешения на работу высококвалифицированному специалисту составляет 14 рабочих дней со дня приема документов. 
"""

RUS_R4_1 = """
Разрешение на временное пребывание
Разрешение на временное проживание — это документ, позволяющий иностранному гражданину или лицу без гражданства жить и работать на территории Российской Федерации в течение 3-х лет. Получение РВП является первой ступенью для оформления иностранным гражданином постоянного проживания на территории Российской Федерации (вида на жительство иностранного гражданина) либо приобретения гражданства Российской Федерации. 
Иностранный гражданин, проживающий в Российской Федерации на основании РВП, имеет следующие преимущества: 
1.Может свободно въезжать на территорию Российской Федерации и выезжать из нее. Однако иностранный гражданин не может отсутствовать в России более полугода, в противном случае РВП иностранца может быть аннулировано. При этом учитывается суммарное нахождение за пределами Российской Федерации более шести месяцев в течение календарного года (исключение составляет отсутствие возможности покинуть территорию иностранного государства по обстоятельствам, связанным с необходимостью экстренного лечения, тяжелой болезнью данного иностранного гражданина или со смертью его близкого родственника, проживавшего на гражданина за пределами Российской Федерации в связи со служебной необходимостью). 2. Может легально трудиться в Российской Федерации, ему не нужно оформлять разрешительные документы для осуществления трудовой деятельности, такие как патент или разрешение на работу. Стоит отметить, что осуществлять трудовую деятельность можно только в том субъекте Российской Федерации, на территории которого иностранному гражданину разрешено временное проживание. 
3.Может зарегистрироваться как индивидуальный предприниматель и официально заниматься бизнесом. 
4.Может получить визу временно проживающего лица, позволяющую находиться в России на протяжении трех лет безвыездно (для граждан стран, имеющих визовый режим с Российской Федерацией). 
4.Не позднее чем за 4 месяца до окончания срока действия РВП имеет право подать документы на получение вида на жительство в Российской Федерации. РВП выдается с учетом квоты, утверждаемой ежегодно Правительством Российской Федерации, а также может быть выдано без учета квоты (в случае наличия у иностранного гражданина оснований, позволяющих оформить РВП в упрощенном порядке).

"""

RUS_R4_2 = """

Необходимые документы
Для получения РВП иностранный гражданин представляет: 
1.Заявление в 2-х экземплярах. 
2.2 личные фотографии, размером 35 x 45 мм, в черно-белом или цветном исполнении с четким изображением лица без головного убора. Лица без гражданства представляют пять фотографий, две из которых размещаются на заявлении по одной на каждом экземпляре. 
3.Паспорт иностранного гражданина либо иной документ, установленный федеральным законом или признаваемый в соответствии с международным договором Российской Федерации в качестве документа, удостоверяющего личность иностранного гражданина. 
4.Документ, выданный полномочным органом государства постоянного проживания не ранее чем за 3 месяца на день подачи заявления, о наличии (отсутствии) судимости у заявителя. 
5.Вид на жительство или иной документ, выданный полномочным органом иностранного государства, который подтверждает проживание иностранного гражданина вне государства его гражданской принадлежности. 
6.Документы, подтверждающие отсутствие у иностранного гражданина заболевания наркоманией и инфекционных заболеваний, которые представляют опасность для окружающих, предусмотренных перечнем, утверждаемым уполномоченным Правительством Российской Федерации федеральным органом исполнительной власти, а также сертификат об отсутствии у заявителя заболевания, вызываемого вирусом иммунодефицита человека (ВИЧ-инфекции). 
7.Документ, подтверждающий владение иностранным гражданином русским языком, знание истории России и основ законодательства Российской Федерации. К таким документам относятся: сертификат о владении русским языком, знании истории России и основ законодательства Российской Федерации; документ государственного образца об образовании (на уровне не ниже основного общего образования), выданный образовательным учреждением на территории государства, входившего в состав СССР, до 1 сентября 1991 года; документ об образовании и (или) о квалификации, выданный лицам, успешно прошедшим государственную итоговую аттестацию на территории Российской Федерации с 1 сентября 1991 года. 
Сроки
Срок предоставления государственной услуги составляет 4 месяца со дня принятия заявления. 
Срок предоставления государственной услуги по заявлению иностранного гражданина, прибывшего в Российскую Федерацию в порядке, не требующем получения визы, составляет 60 суток со дня принятия заявления. 

"""

RUS_R5 = """
Согласно распоряжению Правительства Российской Федерации от 10.12.2024 г. №3641-р, иностранные граждане, проживающие в Пензенской области, могут проходить экзамен по русскому языку как иностранному, истории России и основам законодательства Российской Федерации в Пензенском государственном университете
Адреса: ул. Чкалова, д. 68; ул. Кулакова, д. 1.  
Телефон: +7 (8412) 66-64-09.  
E-mail: test-pgu@pnzgu.ru.  

Экзамен состоит из трёх модулей: русский язык, история России, основы законодательства РФ. Для соискателей разрешения на работу или патента общее время проведения комплексного экзамена — 90 минут, для соискателей разрешения на временное проживание или вида на жительство — 135 минут.
При себе необходимо иметь:
- паспорт,
- нотариально заверенный перевод паспорта, 
- миграционный учёт (регистрация), 
- миграционная карта.
Для граждан Казахстана вместо паспорта возможно предоставление удостоверения. 
Дата экзамена иностранному гражданину сообщается при подаче заявления на сдачу экзамена.

Стоимость экзаменов:
- на разрешение на работу/патент – 3800 рублей.
- на разрешение на временное проживание или вид на жительство – 5900 рублей.
Оплата за экзамен производится путем безналичного перечисления денежных средств банковской картой (для физических лиц), на основании выставленного счета (для юридических лиц, направляющих на экзамен своих работников).
Иностранные граждане, успешно прошедшие экзамен, в течение 7 рабочих дней получают государственный сертификат РФ по русскому языку.
"""

RUS_R6 = """
1.	Соборная мечеть в Пензе, адрес: ул. Бакунина, 10; 34
2.	Пензенская соборная мечеть в Пензе, адрес: просп. Победы, 75М; 34
3.	Мечеть в селе Засечное, адрес: ул. Механизаторов, 10А; 34
4.	Мечеть в Каменке, адрес: ул. Заводская, 12; 3
5.	Мечеть в селе Кочалейка, Каменский район; 3
6.	Мечеть в Городище, адрес: ул. Александра Матросова, 136А; 3
7.	Мечеть в селе Усть-Уза, адрес: ул. Октябрьская, 106; 3
8.	Мечеть в селе Синорово, Лунинский район; 3
9.	Мечеть в рабочем посёлке Чаадаевка, адрес: ул. Хлебная Площадь, 3; 3
10.	Соборная мечеть в селе Средняя Елюзань, адрес: ул. Северная, 46; 3
11.	Мечеть в селе Средняя Елюзань, адреса: ул. Коммунальная, 19; ул. Овражная, 30; 3
12.	Мечеть в селе Махалино, адрес: ул. Куйбышевская, 69; 3
13.	Мечеть в селе Нижняя Елюзань, адрес: ул. Заречная, с49
"""

UZB_START = """
Xayrli kun. Men chatbotman. Savollaringiz bo'lsa so'rang.
Men sizga migratsiya qonunchiligi va Penza viloyatida qolish qoidalarini tushunishingizga yordam beraman.
Quyida sizni qiziqtirgan bo'limlardan birini tanlang
"""

UZB_R1 = """
Migratsiya va ro'yxatga olish
Tavsif
Rossiya Federatsiyasiga kirgan har bir chet ellik Rossiya Federatsiyasi hududida qonuniy yashash uchun yashash joyida migratsiya ro'yxatiga kiritilishi kerak, ya'ni.yashash joyiga kelganligi to'g'risida migratsiya xizmatiga xabar bering. Chet el fuqarosining yashash joyiga kelishi to'g'risida xabarnoma Rossiya ichki ishlar vazirligining hududiy organiga u yashash joyiga kelgan kundan boshlab 7 ish kunidan kechiktirmay beriladi (2006 yil 18 iyuldagi Federal qonunda nazarda tutilgan hollar bundan mustasno). "Rossiya Federatsiyasida chet el fuqarolari va fuqaroligi bo'lmagan shaxslarning migratsiya hisobi to'g'risida" gi 109-FZ-son va xalqaro shartnomalar). Rossiya Federatsiyasida yashovchi chet el fuqarolari va Rossiya Federatsiyasi hududida joylashgan turar-joy binolaridan foydalanish huquqiga ega bo'lgan fuqaroligi bo'lmagan shaxslar vaqtincha (vaqtincha yashash uchun ruxsatnomaga ega) yoki doimiy ravishda (yashash uchun ruxsatnomaga ega) yashash joyida ro'yxatdan o'tishlari kerak. Yashash joyida ro'yxatdan o'tish uchun zarur hujjatlar chet el fuqarosi yoki fuqaroligi bo'lmagan shaxs tomonidan Rossiya ichki ishlar vazirligining hududiy organiga to'g'ridan-to'g'ri turar joy joylashgan joyda topshiriladi.

Kerakli hujjatlar
Yashash joyida migratsiya hisobi:
Qabul qiluvchi tomon Rossiya ichki ishlar vazirligining hududiy organiga shaxsan, elektron shaklda, MFC orqali yoki pochta orqali taqdim etadi:
1. Chet el fuqarosi yoki fuqaroligi bo'lmagan shaxsning yashash joyiga kelishi to'g'risida xabarnoma.
2. Chet el fuqarosi yoki fuqaroligi bo'lmagan shaxsning shaxsini tasdiqlovchi hujjat.
3. Migratsiya kartasi yoki viza (agar mavjud bo'lsa).
4. Davlat xizmatlarini ko 'rsatuvchi organlar, munitsipal xizmatlarni ko' rsatuvchi organlar, boshqa davlat organlari, mahalliy o 'zini o' zi boshqarish organlari yoki davlat organlari yoki mahalliy o 'zini o' zi boshqarish organlariga qarashli tashkilotlar ixtiyorida bo 'lgan ma' lumotlar mavjud bo ' lmagan taqdirda, chet el fuqarosiga haqiqiy yashash uchun taqdim etiladigan turar joy yoki boshqa binolardan foydalanish huquqini tasdiqlovchi hujjat xizmatlar.
5. Chet el fuqarosining tashkilot bilan mehnat yoki fuqarolik-huquqiy shartnomasi yoki chet el fuqarosi tomonidan Rossiya federatsiyasi qonunlarida taqiqlanmagan mehnat yoki boshqa faoliyatni amalga oshirganligini tasdiqlovchi boshqa hujjat, shuningdek tashkilotning imzosi (agar mavjud bo'lsa) muhrlangan tashkilot rahbari yoki boshqa vakolatli mansabdor shaxsining xati.
Yashash joyida ro'yxatdan o'tish:
Rossiya Federatsiyasi hududida joylashgan turar-joy binolaridan foydalanish huquqiga ega bo'lgan doimiy yoki vaqtincha Rossiya Federatsiyasida yashovchi chet el fuqarosi yashash joyida ro'yxatdan o'tish uchun Rossiya ichki ishlar vazirligining hududiy organiga turar joy joylashgan joyda to'g'ridan – to'g'ri-shaxsan, elektron shaklda, MFC orqali murojaat qiladi:
1. Belgilangan shakldagi yashash joyida ro'yxatdan o'tish to'g'risidagi ariza.
2. Shaxsni tasdiqlovchi hujjat.
3. Yashash uchun ruxsatnoma yoki vaqtinchalik yashash uchun ruxsatnoma.
4. Rossiya Federatsiyasi qonunchiligiga muvofiq turar joydan foydalanish huquqini tasdiqlovchi hujjatlar (shartnoma, mulk huquqi to'g'risidagi guvohnoma yoki boshqa hujjat) va ularning nusxalari.
	
Muddatlar
Mansabdor shaxs murojaat qilingan kuni yashash joyida migratsiyani ro'yxatdan o'tkazish/ ro'yxatdan o'tkazish to'g'risida tegishli belgi qo'yadi.
"""

UZB_R2_1 = """
Патенти меҳнатӣ

Патенти кор барои шаҳрвандони хориҷӣ ин иҷозатнома барои фаъолияти меҳнатӣ дар Федератсияи Русия барои шаҳрвандони хориҷӣ мебошад, ки ба қаламрави Федератсияи Русия бо тартиби талаб накардани раводид омадаанд. Ба ибораи дигар, патенти корӣ ҳуҷҷатест, ки барои ҳар як шаҳрванди хориҷие, ки бидуни раводид ба Русия омадааст, зарур аст, ки ба таври қонунӣ фаъолияти меҳнатиро дар қаламрави Федератсияи Русия ба нақша гирифтааст. Шаҳрвандони кишварҳое, ба монанди Молдова, Озарбойҷон, Узбекистон, Тоҷикистон ба патенти корӣ ниез доранд. Бе гирифтани патент шаҳрвандони хориҷӣ ҳуқуқ доранд дар қаламрави Федератсияи Русия кор кунанд: 
1. Онҳое, ки барои истиқомати муваққатӣ е иҷозатномаи истиқомат дар Федератсияи Русия иҷозатнома доранд, инчунин мақоми иштирокчии барномаи Давлатии кӯчонидани ҳамватанони дар хориҷа зиндагӣкунанда ба Федератсияи Русия доранд.
2. Шахсоне, ки дар Федератсияи Русия мақоми гуреза доранд е шахсоне мебошанд, ки дар қаламрави Федератсияи Русия паноҳгоҳи муваққатӣ дода шудаанд.
 3. Донишҷӯени таҳсили рӯзона дар ташкилотҳои таҳсилоти касбӣ ва ташкилотҳои таҳсилоти Олии Федератсияи Россия дар давоми таътил е дар вақти холӣ аз таҳсил дар ин ташкилотҳои таълимӣ, дар ҷамъиятҳои хоҷагидорӣ е шарикии хоҷагидорӣ, ки аз ҷониби ташкилотҳои таҳсилоти олии буҷетӣ е мустақил, ки дар онҳо таҳсил мекунанд, таъсис дода шудаанд. 
4. Намояндагони кишварҳои иштирокчии иттиҳоди иқтисодии Авруосие (ЕАЭС): Белоруссия, Арманистон, Қазоқистон ва Қирғизистон.
 
Ҳуҷҷатҳои зарурӣ
1. Ариза дар бораи додан, ба расмият даровардан, аз нав ба расмият даровардани патент дар як нусха. 2. Ҳуҷҷате, ки шахсияти ин шаҳрванди хориҷиро тасдиқ мекунад ва Аз ҷониби Федератсияи Русия дар ин сифат эътироф карда мешавад.
"""

UZB_R2_2 = """
3. Шартномаи (полиси) суғуртаи ихтиерии тиббӣ, ки дар Қаламрави Федератсияи Россия барои мӯҳлати фаъолияти меҳнатии шаҳрванди хориҷӣ амал мекунад, бо ташкилоти суғуртавии мутобиқи қонунгузории Федератсияи Россия е шартномаи хизматрасонии тиббии пулакӣ, ки бо ташкилоти тиббии дар субъекти Федератсияи Россия қарордошта баста шудааст, баста шудааст, ки дар ҳудуди он шаҳрванди хориҷӣ ният дорад фаъолияти меҳнатиро амалӣ намояд.
4. Ҳуҷҷатҳое, ки мавҷуд набудани бемории нашъамандиро дар шаҳрванди хориҷӣ тасдиқ мекунанд ва дар натиҷаи муоинаи тиббӣ, аз ҷумла таҳқиқоти химиявӣ-токсикологӣ оид ба мавҷудияти маводи мухаддир, моддаҳои психотропӣ ва метаболитҳои онҳо дар бадани инсон ва бемориҳои сироятӣ, ки барои атрофиен хатар доранд, дар рӯйхати бемориҳои сироятӣ, ки барои атрофиен хатар доранд ва барои рад кардан е бекор кардани иҷозатнома барои истиқомати муваққатии шаҳрвандони хориҷӣ ва шахсони бешаҳрвандӣ асос мебошанд, е иҷозатномаи истиқомат е патент е иҷозатномаи Кор Дар Федератсияи Россия, ки Бо фармони Вазорати тандурустии Федератсияи Россия аз 19 ноябри соли 2021 no 1079н тасдиқ шудааст, инчунин сертификат дар бораи набудани шаҳрванди хориҷӣ аз бемории вируси норасоии масунияти одам (сирояти ВНМО).
5. Дархости корфармо, фармоишгари кор (хизматрасонӣ) дар бораи аз нав ба расмият даровардани патент ба шаҳрванди хориҷӣ.
6. Барои шаҳрвандони хориҷӣ, ки фаъолияти меҳнатиро дар шахси ҳуқуқӣ е соҳибкори инфиродӣ е нотариуси хусусӣ, адвокате, ки кабинети адвокатӣ таъсис додааст е шахси дигаре, ки фаъолияти касбии онҳо тибқи қонунҳои федералӣ бояд ба қайди давлатӣ гирифта шавад ва (е) иҷозатнома дода шавад: шартномаи меҳнатӣ е шартномаи ҳуқуқии шаҳрвандӣ барои иҷрои корҳо (хизматрасонӣ), ки байни шаҳрванди хориҷӣ ва корфармо, фармоишгари корҳо (хизматрасонӣ) баста шудааст.
7. Яке аз ҳуҷҷатҳои зерин, ки донистани забони русӣ, донистани таърихи Русия ва асосҳои қонунгузории Федератсияи Русияро тасдиқ мекунад: сертификат дар бораи донистани забони русӣ, донистани таърихи Русия ва асосҳои қонунгузории Федератсияи Русия:
-   ҳуҷҷати намунаи давлатӣ дар бораи таҳсилот (дар сатҳи на камтар аз таҳсилоти умумии асосӣ), ки аз ҷониби муассисаи таълимӣ дар қаламрави давлати БА ҲАЙАТИ СССР дохилшуда то 1 сентябри соли 1991 дода шудааст.
-   ҳуҷҷати маълумот ва (е) тахассус, ки ба шахсоне дода шудааст, ки аз 1 сентябри соли 1991 дар Қаламрави Федератсияи Русия аз аттестатсияи давлатии ҷамъбастӣ бомуваффақият гузаштаанд.
Мӯҳлатҳо
1. Мӯҳлати бақайдгирӣ ва додани патент ба шаҳрванди хориҷӣ набояд аз 10 рӯзи корӣ аз рӯзи қабули ариза дар бораи додани патент аз шаҳрванди хориҷӣ зиед бошад ва дар сурати мавҷуд будани маълумот дар бораи ба қайд гирифтани шаҳрванди хориҷӣ дар мақомоти андоз на дертар аз панҷ рӯзи корӣ аз рӯзи қабули ариза аз шаҳрванди хориҷӣ.
2. Мӯҳлати бақайдгирӣ ва додани нусхаи патент ба шаҳрванди хориҷӣ набояд аз 3 рӯзи корӣ аз рӯзи муроҷиати аризадиҳанда ба шӯъбаи муҳоҷират бо дархости дахлдор зиед бошад.
3. Мӯҳлати бекор кардани патент аз рӯзи қабули ариза дар бораи бекор кардани патент 3 рӯзи корӣ мебошад. Ҳуҷҷатҳое, ки натиҷаи хизматрасонӣ мебошанд, ба шаҳрванди хориҷӣ дар рӯзи дархост барои гирифтани онҳо дода мешаванд.


"""

UZB_R3 = """
Иҷозати кор дар ФЕДЕРАТСИЯИ РУСИЯ
Тавсиф
Иҷозати кор ҳуҷҷатест, ки ҳуқуқи шаҳрванди хориҷӣ е шахси бешаҳрвандро, ки бо тартиби раводид ба Федератсияи Россия меояд, барои амалӣ намудани фаъолияти меҳнатӣ дар Федератсияи Россия аз шахси ҳуқуқӣ е соҳибкори инфиродӣ тасдиқ мекунад. Дар сурати мавҷуд набудани ин ҳуҷҷат фаъолияти меҳнатии шаҳрванди хориҷӣ ғайриқонунӣ ҳисобида мешавад. Ширкатҳое, ки дар Онҳо коргарон бе иҷозати Кор дар Русия кор мекунанд, метавонанд барои ҳар як корманди ғайриқонунӣ то 1 000 000 рубл ҷарима карда шаванд ва дар сурати ошкор шудани қонуншиканиҳои такрории бақайдгирии кормандон корхона метавонад ҳуқуқи идомаи фаъолияти соҳибкории худро аз даст диҳад.
 
Ҳуҷҷатҳои зарурӣ
1. Ариза барои гирифтани иҷозатномаи кор барои ҳар як шаҳрванди хориҷии ҷалбшуда.
2. Нусхаи ҳуҷҷати тасдиқкунандаи шахсияти шаҳрванди хориҷӣ, Ки Аз ҷониби Федератсияи Русия дар ин вазифа эътироф шудааст.
3. Ҳуҷҷатҳои тиббӣ.
 
Барои мутахассиси баландихтисос:
1. Дархост барои ҷалби мутахассиси баландихтисос.
2. Нусхаи ҳуҷҷати тасдиқкунандаи шахсияти шаҳрванди хориҷӣ, Ки Аз ҷониби Федератсияи Русия дар ин вазифа эътироф шудааст.
3. Шартномаи меҳнатӣ е шартномаи ҳуқуқии шаҳрвандӣ барои иҷрои корҳо (хизматрасонӣ) бо мутахассиси баландихтисоси ҷалбшуда, ки эътибор пайдо кардани он бо гирифтани иҷозатномаи кор аз ҷониби мутахассиси баландихтисос вобаста аст.
4. Ӯҳдадории хаттӣ оид ба пардохти (ҷуброн кардани) хароҷоти Федератсияи Русия, ки бо эҳтимоли берун кардани маъмурии федератсияи Русия е депортатсияи мутахассиси баландихтисоси ҷалбкардаи Ӯ алоқаманд аст.
 
Мӯҳлатҳо
1. Мӯҳлати додани иҷозатномаи кор ба шаҳрванди хориҷие, ки ба Федератсияи Россия бо тартиби талаб кардани раводид омадааст, аз рӯзи қабули ҳуҷҷатҳои зарурӣ барои хизматрасонӣ 15 рӯзи корӣ мебошад.
2. Мӯҳлати додани иҷозатномаи кор ба мутахассиси баландихтисос ва аъзои оилаи онҳо, инчунин тамдиди мӯҳлати иҷозатномаи кор ба мутахассиси баландихтисос аз рӯзи қабули ҳуҷҷатҳо 14 рӯзи корӣ мебошад.
"""

UZB_R4_1 = """
Иҷозатномаи истиқомати муваққатӣ ҳуҷҷатест, ки ба шаҳрванди хориҷӣ е шахси бешаҳрванд имкон медиҳад, ки дар Қаламрави Федератсияи Русия 3 сол зиндагӣ ва кор кунад. Гирифтани ИИМ (РВП) зинаи аввал барои гирифтани шаҳрванди хориҷӣ барои истиқомати доимӣ дар Қаламрави Федератсияи Русия (иҷозатномаи истиқомати шаҳрванди хориҷӣ) е гирифтани шаҳрвандии Федератсияи Русия мебошад.
 
Шаҳрванди хориҷие, ки дар Федератсияи Русия дар асоси ИИМ (РВП) зиндагӣ мекунад, бартариҳои зеринро дорад:

1. Метавонад озодона ба қаламрави Федератсияи Русия ворид шавад ва аз он хориҷ шавад. Аммо шаҳрванди хориҷӣ наметавонад дар Русия зиеда аз ним сол ҳузур дошта бошад, вагарна ИИМ (РВП)-и хориҷӣ метавонад бекор карда шавад. Дар ин ҳолат, дар давоми як соли тақвимӣ берун аз Федератсияи Русия зиеда аз шаш моҳ будан ба назар гирифта мешавад (ба истиснои он, ки имконияти тарки қаламрави давлати хориҷӣ бо сабаби зарурати табобати фаврӣ, бемории вазнини ин шаҳрванди хориҷӣ е марги хешованди наздики ӯ, ки дар хориҷи Федератсияи Русия дар робита ба зарурати хидматӣ зиндагӣ мекард, вуҷуд надорад). 

2. Вай метавонад дар Федератсияи Русия қонунӣ кор кунад, ба ӯ лозим нест, ки ҳуҷҷатҳои иҷозатномадиҳиро барои иҷрои фаъолияти меҳнатӣ, ба монанди патент е иҷозатномаи кор, ба расмият дарорад. Бояд қайд кард, ки фаъолияти меҳнатиро танҳо дар субъекти Федератсияи Россия амалӣ кардан мумкин аст, ки дар қаламрави он ба шаҳрванди хориҷӣ иҷозат дода шудааст, ки муваққатан зиндагӣ кунад.

3. Метавонад ҳамчун соҳибкори инфиродӣ сабти ном шавад ва расман ба тиҷорат машғул шавад.

4. Вай метавонад раводиди шахси муваққатан истиқоматкунандаро гирад, ки ба Ӯ имкон медиҳад, ки дар Русия се сол бе сафар бошад (барои шаҳрвандони кишварҳое, ки бо Федератсияи Русия низоми раводид доранд).

5. На дертар аз 4 моҳ пеш аз ба охир расидани мӯҳлати амали ИИМ (РВП) ҳуқуқ дорад ҳуҷҷатҳоро барои гирифтани иҷозатномаи истиқомат дар Федератсияи Русия пешниҳод кунад. ИИМ (РВП) бо назардошти квотае, ки ҳамасола аз ҷониби ҳукумати Федератсияи Русия тасдиқ карда мешавад, дода мешавад ва инчунин метавонад бе назардошти квота дода шавад (дар сурати мавҷуд будани асосҳои шаҳрванди хориҷӣ, ки ИМКОН медиҳад ИИМ (РВП)-ро бо тартиби содда ба расмият дарорад).

Ҳуҷҷатҳои зарурӣ

Барои гирифтани ИИМ (РВП) шаҳрванди хориҷӣ:

1. Изҳорот дар 2 нусха.

2. 2 аксҳои шахсӣ, андозаи 35 х 45 мм, дар шакли сиеҳ ва сафед е ранга бо тасвири дақиқи чеҳра бе сарпӯш. Шахсони бешаҳрвандӣ панҷ аксро пешниҳод мекунанд, ки дутои онҳо дар ариза дар ҳар як нусха ҷойгир карда мешаванд.

3. Шиносномаи шаҳрванди хориҷӣ е ҳуҷҷати дигаре, ки бо қонуни федералӣ муқаррар шудааст е тибқи шартномаи байналмилалии Федератсияи Русия ҳамчун ҳуҷҷати тасдиқкунандаи шахсияти шаҳрванди хориҷӣ эътироф карда мешавад.

4. Ҳуҷҷате, ки аз ҷониби мақомоти ваколатдори давлати истиқомати доимӣ на пештар аз 3 моҳ дар рӯзи пешниҳоди ариза дар бораи мавҷудияти (набудани) судият дар аризадиҳанда дода шудааст.
"""

UZB_R4_2 = """
5. Иҷозатномаи истиқомат е дигар ҳуҷҷате, ки аз ҷониби мақомоти ваколатдори давлати хориҷӣ дода шудааст, ки истиқомати шаҳрванди хориҷиро берун аз давлати мансубияти шаҳрвандии ӯ тасдиқ мекунад.

6. Ҳуҷҷатҳое, ки набудани шаҳрванди хориҷиро аз бемории нашъамандӣ ва бемориҳои сироятӣ тасдиқ мекунанд, ки барои атрофиен, ки дар рӯйхати тасдиқнамудаи ҳукумати ваколатдори Федератсияи Россия аз ҷониби мақомоти иҷроияи ҳокимияти федералӣ, инчунин шаҳодатнома дар бораи набудани беморие, ки аз вируси норасоии масунияти одам (сирояти ВНМО) ба вуҷуд омадааст, хатар эҷод мекунанд.

7. Ҳуҷҷати тасдиқкунандаи донистани забони русӣ аз ҷониби шаҳрванди хориҷӣ, донистани таърихи Русия ва асосҳои қонунгузории Федератсияи Русия. Ба чунин ҳуҷҷатҳо дохил мешаванд: сертификат дар бораи донистани забони русӣ, донистани таърихи Русия ва асосҳои қонунгузории Федератсияи Русия; ҳуҷҷати намунаи давлатӣ дар бораи таҳсилот (дар сатҳи на камтар аз таҳсилоти умумии асосӣ), ки аз ҷониби муассисаи таълимӣ дар қаламрави давлати БА ҲАЙАТИ СССР дохилшуда то 1 сентябри соли 1991 дода шудааст; ҳуҷҷати маълумот ва (е) тахассус, ки ба шахсоне дода шудааст, ки аз 1 сентябри соли 1991 дар Қаламрави Федератсияи Русия аз аттестатсияи давлатии ҷамъбастӣ бомуваффақият гузаштаанд.

Мӯҳлатҳо

1. Понздаҳ рӯзи корӣ аз рӯзи қабули ариза аз шаҳрванди хориҷӣ, Ки Федератсияи Русия ба ӯ паноҳандагии сиесӣ додааст е аз шахсе, ки шаҳрвандии федератсияи Русияро қатъ кардааст.

2. Ду моҳ аз рӯзи қабули ариза аз ҷониби шахсе, ки забони русиро медонад е аз ҷониби Шахсе, ки Дар Федератсияи Русия зиндагӣ мекунад ва нисбати ӯ қарори гирифтани шаҳрвандӣ бекор карда шудааст.

3. Се моҳ аз рӯзи қабули ариза аз шаҳрванди хориҷӣ, ки худ е хеши ӯ аз рӯи хатти рост ба боло, фарзандхондкунанда е ҳамсари (ҳамсари) ӯ аз ҚАЛАМРАВИ Асср Қрим ғайриқонунӣ депортатсия шудааст, инчунин хешованди хатти рост ба поен, фарзандони фарзандхондшуда е ҳамсари (ҳамсари) шаҳрванди хориҷии зикршуда е аз мутахассиси баландихтисос, ки фаъолияти меҳнатиро Дар Федератсияи Россия е аз шаҳрванди Ҷумҳурии Беларус амалӣ мекунад.

4. Чор моҳ аз рӯзи қабули ариза аз шаҳрванди хориҷӣ е шахси бешаҳрвандӣ, ки на камтар аз ҳашт моҳ дар давоми соли аввали истиқомат дар Федератсияи Россия дар Асоси иҷозатномаи истиқомати муваққатӣ зиндагӣ кардааст, е аз шаҳрванди ДАР ҚАЛАМРАВИ РСФСР таваллудшуда е аз шаҳрванди хориҷие, ки доимо дар Федератсияи Россия зиндагӣ мекунад, волидайн (фарзандхондкунанда, парастор, парастор) мебошад.
"""

UZB_R5 = """
Rossiya Federatsiyasi Hukumatining 10.12.2024 yildagi 3641-r-son buyrug'iga binoan, Penza viloyatida yashovchi chet el fuqarolari Penza davlat universitetida rus tilidan chet tili, Rossiya tarixi va Rossiya Federatsiyasi qonunchiligi asoslari bo'yicha imtihon topshirishlari mumkin.
Manzillar: st. Chkalova, 68; st. Kulakova, 1.
Telefon: +7 (8412) 66-64-09.
Elektron pochta: test-pgu@pnzgu.ru.

Imtihon uchta moduldan iborat: rus tili, Rossiya tarixi, Rossiya qonunchiligi asoslari. Ishga ruxsatnoma yoki patent olishga da’vogarlar uchun kompleks ekspertizadan o‘tish uchun umumiy vaqt 90 daqiqa, vaqtinchalik propiska yoki propiska uchun talabgorlar uchun 135 daqiqani tashkil etadi.
Siz bilan birga bo'lishi kerak:
- pasport,
- pasportning notarial tasdiqlangan tarjimasi;
- migratsiya ro'yxatidan o'tish;
- migratsiya kartasi.
Qozog‘iston fuqarolari uchun pasport o‘rniga ID karta taqdim etilishi mumkin.
Imtihon o'tkaziladigan sana chet el fuqarosiga imtihon topshirish uchun ariza topshirilgandan so'ng xabar qilinadi.

Imtihonlar narxi:
- ishlash uchun ruxsat / patent uchun - 3800 rubl.
- vaqtinchalik yashash uchun ruxsatnoma yoki yashash uchun ruxsatnoma uchun - 5900 rubl.
Imtihon uchun to‘lov berilgan schyot-faktura asosida (o‘z xodimlarini imtihonga yuborayotgan yuridik shaxslar uchun) bank kartasi orqali pul mablag‘larini naqd pulsiz o‘tkazish yo‘li bilan (jismoniy shaxslar uchun) amalga oshiriladi.
Imtihonni muvaffaqiyatli topshirgan chet el fuqarolari 7 ish kuni ichida rus tilida rus davlat sertifikatini oladilar.
"""

UZB_R6 = """
1. Penzadagi sobor masjidi, manzili: st. Bakunina, 10; 34
2. Penza shahridagi Penza sobori masjidi, manzil: pr. G'alabalar, 75M; 34
3. Zasechnoye qishlog'idagi masjid, manzil: ko'ch. Mexanizatorlar, 10A; 34
4. Kamenka masjidi, manzil: st. Zavod, 12; 3
5. Kamenskiy tumani, Kochaleyka qishlog‘idagi masjid; 3
6. Gorodishche masjidi, manzil: st. Aleksandra Matrosova, 136A; 3
7. Masjid Ust-O'za qishlog'i, manzil: ko'ch. Oktyabrskaya, 106; 3
8. Luninskiy tumani, Sinorovo qishlog'idagi masjid; 3
9. Chaadaevka ishchilar shaharchasidagi masjid, manzil: ko'ch. Xlebnaya maydoni, 3; 3
10. Srednyaya Elyuzan qishlog'idagi sobor masjidi, manzil: st. Severnaya, 46; 3
11. Srednyaya Elyuzan qishlog'idagi masjid, manzillar: st. Kommunalnaya, 19; st. Ovrajnaya, 30; 3
12. Maxalino qishlog'idagi masjid, manzil: ko'ch. Kuybishevskaya, 69; 3
13. Nijnyaya Elyuzan qishlog'idagi masjid, manzil: ko'ch. Zarechnaya, s49
"""
